<a href="https://colab.research.google.com/github/s23912/pad/blob/main/PAD_LAB_03_ZADANIE_DOMOWE_pawel_ungier.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Pawel Ungier [s23912]
#Zadanie domowe PAD_LAB_03

In [ ]:
# Pre processing of data
import pandas as pd
path = '/content/drive/MyDrive/PAD/PAD_03/Zadanie_domowe/bank.csv'
df = pd.read_csv(path, sep=';')
df.head()

   age          job  marital  education  ...   contact  day month duration
0   30   unemployed  married    primary  ...  cellular   19   oct       79
1   33     services  married  secondary  ...  cellular   11   may      220
2   35   management   single   tertiary  ...  cellular   16   apr      185
3   30   management  married   tertiary  ...   unknown    3   jun      199
4   59  blue-collar  married  secondary  ...   unknown    5   may      226

[5 rows x 12 columns]

In [ ]:
print(df.shape)

(4521, 12)

In [ ]:
df.isnull().any(axis=1).sum()

0

In [ ]:
#nie ma niekompletnych danych

In [ ]:
# a) W którym miesiącu dokonano najwięcej połączeń, a w którym najmniej?
df_by_months_count = df.groupby('month')['duration'].count()
df_by_months_count

month
apr     293
aug     633
dec      20
feb     222
jan     148
jul     706
jun     531
mar      49
may    1398
nov     389
oct      80
sep      52
Name: duration, dtype: int64

In [ ]:
month_count_max = df_by_months_count[df_by_months_count==df_by_months.max()].index
print('miesiac z najwiekszą liczbą połączeń to:', month_max[0])

miesiac z najwiekszą liczbą połączeń to: may

In [ ]:
# W którym miesiącu średni czas rozmowy był największy?
df_by_months_mean = round(df.groupby('month')['duration'].mean(),2)
df_by_months_mean

month
apr    294.35
aug    243.74
dec    416.90
feb    255.70
jan    269.54
jul    271.21
jun    252.43
mar    198.90
may    267.32
nov    272.07
oct    272.80
sep    215.73
Name: duration, dtype: float64

In [ ]:
month_mean_max = df_by_months_mean[df_by_months_mean == df_by_months_mean.max()].index
print('miesiac z najwiekszym średnim czasem rozmowy to: ', month_mean_max[0])

miesiac z najwiekszym średnim czasem rozmowy to:  dec

In [ ]:
#Czy wykształcenie przekłada się na posiadane oszczędności? (Kolumna balance)

df_by_education_min = round(df.groupby('education')['balance'].min(),2)
df_by_education_min

education
primary      -966
secondary   -2082
tertiary    -3313
unknown      -715
Name: balance, dtype: int64

In [ ]:
df_by_education_max = round(df.groupby('education')['balance'].max(),2)
df_by_education_max

education
primary      71188
secondary    26452
tertiary     42045
unknown      21244
Name: balance, dtype: int64

In [ ]:
df_by_education_mean = round(df.groupby('education')['balance'].mean(),2)
df_by_education_mean

education
primary      1411.54
secondary    1196.81
tertiary     1775.42
unknown      1701.25
Name: balance, dtype: float64

In [ ]:
df_by_education_quantile = round(df.groupby('education')['balance'].quantile(0.9),2)
df_by_education_quantile

education
primary      3855.5
secondary    3422.0
tertiary     4764.7
unknown      4697.2
Name: balance, dtype: float64

In [ ]:
print('wykształcenie nie ma jednoznacznego wpływu na balance')
print('obserwujemy , że 90% osób z wykształceniem trzeciego stopnia ma balance większy od stopnia drugiego i pierwszego ')
print('ale obserwujemy również, że 90% osób z wykształceniem pierwszego stopnia ma balance większy od stopnia drugiego')

wykształcenie nie ma jednoznacznego wpływu na balance
obserwujemy , że 90% osób z wykształceniem trzeciego stopnia ma balance większy od stopnia drugiego i pierwszego
ale obserwujemy również, że 90% osób z wykształceniem pierwszego stopnia ma balance większy od stopnia drugiego

In [ ]:
#Ile lat miała najstarsza osoba będąca w związku małżeńskim, a ile najstarszy singiel?

marital_statuses = df.groupby('marital')['marital'].count()
marital_statuses

marital
divorced     528
married     2797
single      1196
Name: marital, dtype: int64

In [ ]:
married = df[df['marital']=='married']
married

      age            job  marital  education  ...   contact  day month duration
0      30     unemployed  married    primary  ...  cellular   19   oct       79
1      33       services  married  secondary  ...  cellular   11   may      220
3      30     management  married   tertiary  ...   unknown    3   jun      199
4      59    blue-collar  married  secondary  ...   unknown    5   may      226
6      36  self-employed  married   tertiary  ...  cellular   14   may      341
...   ...            ...      ...        ...  ...       ...  ...   ...      ...
4514   38    blue-collar  married  secondary  ...  cellular   20   apr       45
4516   33       services  married  secondary  ...  cellular   30   jul      329
4517   57  self-employed  married   tertiary  ...   unknown    9   may      153
4518   57     technician  married  secondary  ...  cellular   19   aug      151
4519   28    blue-collar  married  secondary  ...  cellular    6   feb      129

[2797 rows x 12 columns]

In [ ]:
print('najstarsza osoba w związku małożeńskim miała',married['age'].max(), 'lat')

najstarsza osoba w związku małożeńskim miała 87 lat

In [ ]:
singles = df[df['marital'] =='single']
singles

      age           job marital  education  ...   contact  day month duration
2      35    management  single   tertiary  ...  cellular   16   apr      185
5      35    management  single   tertiary  ...  cellular   23   feb      141
13     20       student  single  secondary  ...  cellular   30   apr      261
17     37        admin.  single   tertiary  ...  cellular   20   apr      114
18     25   blue-collar  single    primary  ...   unknown   23   may      250
...   ...           ...     ...        ...  ...       ...  ...   ...      ...
4497   31  entrepreneur  single   tertiary  ...  cellular   20   nov      185
4504   42   blue-collar  single  secondary  ...  cellular   13   may      951
4505   32        admin.  single  secondary  ...   unknown   26   may     1234
4515   32      services  single  secondary  ...  cellular    7   jul      624
4520   44  entrepreneur  single   tertiary  ...  cellular    3   apr      345

[1196 rows x 12 columns]

In [ ]:
print('najmłodsza singiel miał lat',married['age'].min())

najmłodsza singiel miał lat 23